In [30]:
# Dependencies
import pandas as pd
import scipy.stats as st
import numpy as np

In [31]:
# ratings file
rating = pd.read_csv('../Movies_datasets/ratings.csv')
rating.head()

   userId  movieId  rating   timestamp
0       1      110     1.0  1425941529
1       1      147     4.5  1425942435
2       1      858     5.0  1425941523
3       1     1221     5.0  1425941546
4       1     1246     5.0  1425941556

In [32]:
rating_df = pd.DataFrame(rating)
rating_df = rating[['movieId','rating']]
rating_df.head()

   movieId  rating
0      110     1.0
1      147     4.5
2      858     5.0
3     1221     5.0
4     1246     5.0

In [33]:
rating_df.rename(columns={'movieId':'id'}, inplace=True,)
rating_df.head()

C:\Users\uldom\anaconda3\lib\site-packages\pandas\core\frame.py:4296: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

     id  rating
0   110     1.0
1   147     4.5
2   858     5.0
3  1221     5.0
4  1246     5.0

In [34]:
# Average rating by movie id
rating_df = rating_df.groupby('id')['rating'].mean()
rating_df

id
1         3.888157
2         3.236953
3         3.175550
4         2.875713
5         3.079565
            ...
176267    4.000000
176269    3.500000
176271    5.000000
176273    1.000000
176275    3.000000
Name: rating, Length: 45115, dtype: float64

In [35]:
# movies dataset
movies = pd.read_csv('..\Movies_datasets\movies_metadata.csv')
movies = pd.DataFrame(movies)
movies = movies[['id','title','budget','revenue']]
movies.head()

C:\Users\uldom\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3146: DtypeWarning: Columns (10) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

      id                        title    budget      revenue
0    862                    Toy Story  30000000  373554033.0
1   8844                      Jumanji  65000000  262797249.0
2  15602             Grumpier Old Men         0          0.0
3  31357            Waiting to Exhale  16000000   81452156.0
4  11862  Father of the Bride Part II         0   76578911.0

In [36]:
# include a column to calculate the profit for each movie
movies["profit"] = ""
movies

           id                        title    budget      revenue profit
0         862                    Toy Story  30000000  373554033.0
1        8844                      Jumanji  65000000  262797249.0
2       15602             Grumpier Old Men         0          0.0
3       31357            Waiting to Exhale  16000000   81452156.0
4       11862  Father of the Bride Part II         0   76578911.0
...       ...                          ...       ...          ...    ...
45461  439050                       Subdue         0          0.0
45462  111109          Century of Birthing         0          0.0
45463   67758                     Betrayal         0          0.0
45464  227506             Satan Triumphant         0          0.0
45465  461257                     Queerama         0          0.0

[45466 rows x 5 columns]

In [46]:
# cleaning the budget column
clean_movies = movies[movies["budget"] != "/ff9qCepilowshEtG2GYWwzt2bs4.jpg"]
clean_movies = clean_movies[clean_movies["budget"] != "/zV8bHuSL6WXoD6FWogP9j4x80bL.jpg"]
clean_movies = clean_movies[clean_movies["budget"] != "/zaSf5OG7V8X8gqFvly88zDdRm46.jpg"]
clean_movies

           id                        title    budget      revenue profit
0         862                    Toy Story  30000000  373554033.0
1        8844                      Jumanji  65000000  262797249.0
2       15602             Grumpier Old Men         0          0.0
3       31357            Waiting to Exhale  16000000   81452156.0
4       11862  Father of the Bride Part II         0   76578911.0
...       ...                          ...       ...          ...    ...
45461  439050                       Subdue         0          0.0
45462  111109          Century of Birthing         0          0.0
45463   67758                     Betrayal         0          0.0
45464  227506             Satan Triumphant         0          0.0
45465  461257                     Queerama         0          0.0

[45463 rows x 5 columns]

In [48]:
# Budget and revenue as float
clean_movies['budget'] = clean_movies['budget'].astype(float)
clean_movies['revenue'] = clean_movies['revenue'].astype(float)
clean_movies

           id                        title      budget      revenue profit
0         862                    Toy Story  30000000.0  373554033.0
1        8844                      Jumanji  65000000.0  262797249.0
2       15602             Grumpier Old Men         0.0          0.0
3       31357            Waiting to Exhale  16000000.0   81452156.0
4       11862  Father of the Bride Part II         0.0   76578911.0
...       ...                          ...         ...          ...    ...
45461  439050                       Subdue         0.0          0.0
45462  111109          Century of Birthing         0.0          0.0
45463   67758                     Betrayal         0.0          0.0
45464  227506             Satan Triumphant         0.0          0.0
45465  461257                     Queerama         0.0          0.0

[45463 rows x 5 columns]

In [49]:
# obtain the profit as the difference between revenue and budget
clean_movies['profit'] = clean_movies['revenue'] - clean_movies['budget']
clean_movies

,id,title,budget,revenue,profit
0,862,Toy Story,30000000.0,373554033.0,343554033.0
1,8844,Jumanji,65000000.0,262797249.0,197797249.0
2,15602,Grumpier Old Men,0.0,0.0,0.0
3,31357,Waiting to Exhale,16000000.0,81452156.0,65452156.0
4,11862,Father of the Bride Part II,0.0,76578911.0,76578911.0
...,...,...,...,...,...
45461,439050,Subdue,0.0,0.0,0.0
45462,111109,Century of Birthing,0.0,0.0,0.0
45463,67758,Betrayal,0.0,0.0,0.0
45464,227506,Satan Triumphant,0.0,0.0,0.0
45465,461257,Queerama,0.0,0.0,0.0